## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.app will be updated in-place
  ~ resource "azurerm_container_app" "app" {
        id                            = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.App/containerApps/ca-vscode-privatemktplce"
        name                          = "ca-vscode-privatemktplce"
        tags                          = {}
      - workload_profile_name         = "Consumption" -> null
        # (9 unchanged attributes hidden)

      ~ template {
            # (6 unchanged attributes hidden)

          ~ container {
                name              = "vscode-private-marketplace"
                # (6 unchanged attributes hidden)

              + env {
                  + name  = "Marketplace__Logging__LogToConsole"
                  + value = "true"
                }
              + env {
                  + name  = "Marketplace__ExtensionSourceDirectory"
                  + value = "/data/extensions"
                }
              + env {
                  + name  = "Marketplace__LogsDirectory"
                  + value = "/data/logs"
                }

              + volume_mounts {
                  + name = "extensions"
                  + path = "/data/extensions"
                }
              + volume_mounts {
                  + name = "logs"
                  + path = "/data/logs"
                }

                # (1 unchanged block hidden)
            }

          + volume {
              + name         = "extensions"
              + storage_name = "extensions"
              + storage_type = "AzureFile"
            }
          + volume {
              + name         = "logs"
              + storage_name = "logs"
              + storage_type = "AzureFile"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app_environment_storage.extensions will be created
  + resource "azurerm_container_app_environment_storage" "extensions" {
      + access_key                   = (sensitive value)
      + access_mode                  = "ReadOnly"
      + account_name                 = "stvscodeprivatemktplce"
      + container_app_environment_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.App/managedEnvironments/cae-vscode-privatemktplce"
      + id                           = (known after apply)
      + name                         = "extensions"
      + share_name                   = "extensions"
    }

  # azurerm_container_app_environment_storage.logs will be created
  + resource "azurerm_container_app_environment_storage" "logs" {
      + access_key                   = (sensitive value)
      + access_mode                  = "ReadWrite"
      + account_name                 = "stvscodeprivatemktplce"
      + container_app_environment_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.App/managedEnvironments/cae-vscode-privatemktplce"
      + id                           = (known after apply)
      + name                         = "logs"
      + share_name                   = "logs"
    }

  # azurerm_storage_account.sa[0] has moved to azurerm_storage_account.sa
    resource "azurerm_storage_account" "sa" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.Storage/storageAccounts/stvscodeprivatemktplce"
        name                               = "stvscodeprivatemktplce"
        tags                               = {}
        # (97 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_share.extensions will be created
  + resource "azurerm_storage_share" "extensions" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "extensions"
      + quota               = 5
      + resource_manager_id = (known after apply)
      + storage_account_id  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.Storage/storageAccounts/stvscodeprivatemktplce"
      + url                 = (known after apply)
    }

  # azurerm_storage_share.logs will be created
  + resource "azurerm_storage_share" "logs" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "logs"
      + quota               = 5
      + resource_manager_id = (known after apply)
      + storage_account_id  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.Storage/storageAccounts/stvscodeprivatemktplce"
      + url                 = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>